In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.377802  3.182088
1  X   beta  0.651621  0.013220
2  Y  alpha  1.269628 -1.905600
3  Y   beta  0.062178 -0.393388
4  Z  alpha -0.689867  0.342197

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [7]:
group1.count()

k1
X    2
Y    2
Z    1
Name: dataset1, dtype: int64

In [8]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [11]:
dframe['dataset1'].groupby([cities,month]).sum()

LA  FEB    0.651621
    JAN    1.269628
NY  FEB    0.062178
    JAN   -0.312065
Name: dataset1, dtype: float64

In [15]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.377802  3.182088
1  X   beta  0.651621  0.013220
2  Y  alpha  1.269628 -1.905600
3  Y   beta  0.062178 -0.393388
4  Z  alpha -0.689867  0.342197

In [16]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.514712  1.597654
Y   0.665903 -1.149494
Z  -0.689867  0.342197

In [17]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.377802  3.182088
   beta   0.651621  0.013220
Y  alpha  1.269628 -1.905600
   beta   0.062178 -0.393388
Z  alpha -0.689867  0.342197

In [18]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [21]:
for name,group in dframe.groupby('k1'):
    print('This is the %s group' %name)
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.377802  3.182088
1  X   beta  0.651621  0.013220


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  1.269628 -1.905600
3  Y   beta  0.062178 -0.393388


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.689867  0.342197

In [23]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('Key1 = %s Key2 = %s' %(k1,k2))
    print (group)
    print ('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  0.377802  3.182088


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  0.651621   0.01322


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  1.269628   -1.9056


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta  0.062178 -0.393388


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.689867  0.342197

In [24]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict

{'X':   k1     k2  dataset1  dataset2
 0  X  alpha  0.377802  3.182088
 1  X   beta  0.651621  0.013220, 'Y':   k1     k2  dataset1  dataset2
 2  Y  alpha  1.269628 -1.905600
 3  Y   beta  0.062178 -0.393388, 'Z':   k1     k2  dataset1  dataset2
 4  Z  alpha -0.689867  0.342197}

In [25]:
dataset_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [27]:
dataset_group.mean()

          dataset2
k1 k2
X  alpha  3.182088
   beta   0.013220
Y  alpha -1.905600
   beta  -0.393388
Z  alpha  0.342197

In [31]:
dataset_group.describe()

         dataset2                                                        \
            count      mean std       min       25%       50%       75%
k1 k2
X  alpha      1.0  3.182088 NaN  3.182088  3.182088  3.182088  3.182088
   beta       1.0  0.013220 NaN  0.013220  0.013220  0.013220  0.013220
Y  alpha      1.0 -1.905600 NaN -1.905600 -1.905600 -1.905600 -1.905600
   beta       1.0 -0.393388 NaN -0.393388 -0.393388 -0.393388 -0.393388
Z  alpha      1.0  0.342197 NaN  0.342197  0.342197  0.342197  0.342197


               max
k1 k2
X  alpha  3.182088
   beta   0.013220
Y  alpha -1.905600
   beta  -0.393388
Z  alpha  0.342197